
#+TITLE: Projeto Interdisciplinar

#+LATEX_HEADER: \usepackage{pgfgantt}
#+LATEX_HEADER: \usepackage{lscape}
#+LATEX_HEADER: \usepackage{graphicx}

* no-exports its :noexports:
** about dynamic blocks
   http://orgmode.org/manual/Dynamic-blocks.html
   These command update dynamic blocks:  
   C-c C-x C-u     (org-dblock-update)

** dead-line and schedule
   org-deadline (C-c C-d)
   org-schedule (C-c C-s)


* Escopo do projeto
O Projeto Interdisciplinar tem por objetivo empregar o conhecimento
das diversas disciplinas para construção de um site e publicação deste
site.


* Requisitos mínimos para o Site do Projeto Interdisciplinar
** Requisito Funcional 1
   O projeto do site deverá permitir manutenção de um cadastro de usuários do
   site (Crud de usuários)
** Requisito Funcional 2
   O Site deverá ter no mínimo três páginas de conteúdo (Não contando
   as páginas de administração de usuários do site)
** Requisito Funcional 3   
   Deverá haver menu de navegação para as páginas do site
** Requisito Funcional 4
   Apenas o usuário com papel de administrador poderá fazer manutenção
   de usuários do site
** Requisito Funcional 5
   O papel de administrador pode ser associado ou desaciado de qualquer usuário
   cadastrado do site.
** Requisito Funcional 6
   Pode haver mais de um usuário administrador, mas deverá haver pelo
   menos um usuários que seja administrador.



* Projeto Interdisciplinar
 :PROPERTIES:
 :ID:       projeto-interdisciplinar
 :END:
** Ministrações Plano de Curso
*** Write manual
    DEADLINE: <2017-06-30 Sex> SCHEDULED: <2017-02-06 Seg>
    
*** Fix bugs
    DEADLINE: <2017-06-30 Sex> SCHEDULED: <2017-02-06 Seg>





#+BEGIN_landscape
#+BEGIN: org-gantt-chart   :id "projeto-interdisciplinar" :use-id-subheadlines t :start-date "2017-02-13" :end-date "2017-06-12" :format "on %d/%m/%Y at %H:%M"
\begin{ganttchart}[time slot format=isodate, vgrid={*4{dashed},*3{black}}]{2017-02-13}{2017-06-12}
\gantttitlecalendar{year, month=name, day}\\
\ganttgroup[group left shift=0.0, group right shift=-0.0, name=uniqueid1]{Ministrações Plano de Curso}{2017-02-06}{2017-06-30}\\
  \ganttbar[bar left shift=0.0, bar right shift=-0.0, name=uniqueid2]{Write manual}{2017-02-06}{2017-06-30}\\
  \ganttbar[bar left shift=0.0, bar right shift=-0.0, name=uniqueid3]{Fix bugs}{2017-02-06}{2017-06-30}\\
\end{ganttchart}
#+END
#+END_landscape


* org-gantt-todo
 :PROPERTIES:
 :ID:       todo-deadlines-schedules
 :END:
   
** Ministrações Plano de Curso
*** Write manual
    SCHEDULED: <2015-05-25 Mo> DEADLINE: <2015-05-28 Do>
*** Fix bugs
   SCHEDULED: <2015-05-27 Mi> DEADLINE: <2015-05-30 Sa>
** Other stuff
   SCHEDULED: <2015-05-20 Mi> DEADLINE: <2015-05-28 Do>
*** Add features
    SCHEDULED: <2015-05-22 Fr> DEADLINE: <2015-05-26 Di>
*** Add missing docstrings
    DEADLINE: <2015-05-27 Mi> SCHEDULED: <2015-05-24 So>

#+BEGIN: org-gantt-chart :id "todo-deadlines-schedules"
\begin{ganttchart}[time slot format=isodate, vgrid={*2{dashed},*3{black},*2{dashed}}]{2015-05-20}{2015-05-30}
\gantttitlecalendar{year, month=name, day}\\
\ganttgroup[group left shift=0.0, group right shift=-0.0, name=todo-deadlines-schedules]{org-gantt-todo}{2015-05-20}{2015-05-30}\\
  \ganttbar[bar left shift=0.0, bar right shift=0, name=uniqueid1]{anotacoes :no-exports:}{2015-05-20}{2015-05-20}\\
  \ganttgroup[group left shift=0.0, group right shift=-0.0, name=uniqueid2]{Ministrações Plano de Curso}{2015-05-25}{2015-05-30}\\
    \ganttbar[bar left shift=0.0, bar right shift=-0.0, name=uniqueid3]{Write manual}{2015-05-25}{2015-05-28}\\
    \ganttbar[bar left shift=0.0, bar right shift=-0.0, name=uniqueid4]{Fix bugs}{2015-05-27}{2015-05-30}\\
  \ganttgroup[group left shift=0.0, group right shift=-0.0, name=uniqueid5]{Other stuff}{2015-05-20}{2015-05-28}\\
    \ganttbar[bar left shift=0.0, bar right shift=-0.0, name=uniqueid6]{Add features}{2015-05-22}{2015-05-26}\\
    \ganttbar[bar left shift=0.0, bar right shift=-0.0, name=uniqueid7]{Add missing docstrings}{2015-05-24}{2015-05-27}\\
\end{ganttchart}
#+END

* OBJETIVO DO PROJ INTERDISCIPLINAR PARA 1 Sem 2017 - Por um site (com javascript) no ar [1/4]
** TODO POR UM SITE *(COM JAVASCRIPT)* NO AR  [32%]
   DEADLINE: <2017-06-12 Seg> SCHEDULED: <2017-06-12 Seg>
   :PROPERTIES:
   :CUSTOM_ID: Site no Ar
   :END:      
** TODO don't bother
** TODO one
** DONE two
* Ordered-Test :test:
   DEADLINE: <2015-05-26 Di>
  :PROPERTIES:
  :ORDERED:  t
  :ID: ordered123
  :END:      
** Order1
   CLOCK: [2015-05-20 Mi 11:06]--[2015-05-20 Mi 11:06] =>  0:00
   CLOCK: [2015-05-19 Di 17:00]--[2015-05-20 Mi 01:30] =>  8:30
   CLOCK: [2015-05-19 Di 17:40]--[2015-05-20 Mi 01:10] =>  7:30
   :PROPERTIES:
   :Effort:   1d
   :END:
** Order2
   CLOCK: [2015-05-27 Mi 13:35]--[2015-05-27 Mi 21:35] =>  8:00
   :PROPERTIES:
   :Effort:   2d
   :END:
** Millstone 							   :milestone:
* Ordered-Test2 :toast:
  :PROPERTIES:
  :ORDERED:  t
  :ID: ordered123
  :END:      
** Order3
   SCHEDULED: <2015-05-21 Do>
   :PROPERTIES:
   :Effort:   1d
   :END:
** Order4 :l2tag:
*** SO 1
   :PROPERTIES:
   :Effort:   3:00
   :END:
*** SO 2
   :PROPERTIES:
   :Effort:   5:00
   :linked-to: ltt
   :END:
*** SO 3
   :PROPERTIES:
   :Effort:   3:00
   :END:

* Direct Schedule Test
  DEADLINE: <2015-06-04 Do> SCHEDULED: <2015-05-15 Fr>
* Linked-to-test
** Linked-to-test
   :PROPERTIES:
   :ID: ltt       
   :Effort:   3d
   :END:      

#+BEGIN: org-gantt-chart :id "ltt"
\begin{ganttchart}[time slot format=isodate, vgrid={*4{dashed},*3{black}}]{2017-01-16}{2017-01-16}
\gantttitlecalendar{year, month=name, day}\\
\ganttbar[bar left shift=0, bar right shift=0, name=ltt, bar label font=\color{black!50}]{Linked-to-test}{2017-01-16}{2017-01-16}\\
\end{ganttchart}
#+END

asdfasdf

asdfasdfasdf
